IRP/src/Catalogs/IntegrationSettings/IntegrationSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>IntegrationSettings</name>
 <attributes>
  <name>ExternalDataProc</name>
  <type>
   <types>CatalogRef.ExternalDataProc</types>
  </type>
 </attributes>
 <attributes>
  <name>ExternalDataProcSettings</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>IntegrationType</name>
  <type>
   <types>EnumRef.IntegrationType</types>
  </type>
 </attributes>
 <attributes>
  <name>StoreInSecureStorage</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ConnectionSetting</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>CatalogRef.IntegrationSettings</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
     <length>512</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Hide</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConnectionSettingTest</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>CatalogRef.IntegrationSettings</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
     <length>512</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Hide</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/IntegrationSettings/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	UpdateSecureStorage();
	
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure UpdateSecureStorage()
	If ThisObject.StoreInSecureStorage Then
		For Each Row In ThisObject.ConnectionSetting Do
			If Row.Hide Then
				SetPrivilegedMode(True);
				SecureDataStorage.Add(ThisObject.Ref, Row.Key, Row.Value);
				SetPrivilegedMode(False);
				Row.Value = SecureDataStorage.PlaceHolder();
			EndIf;
		EndDo;
		For Each Row In ThisObject.ConnectionSettingTest Do
			If Row.Hide Then
				SetPrivilegedMode(True);
				SecureDataStorage.Add(ThisObject.Ref, "Test_" + Row.Key, Row.Value);
				SetPrivilegedMode(False);
				Row.Value = SecureDataStorage.PlaceHolder();
			EndIf;
		EndDo;
	EndIf;
EndProcedure
